package part5;

/*
Задания к базе world
1.Составить запрос на выборку следующих данных:
2.Названия городов и округов с населением более 1 млн. жителей
3.Количество городов в США, исключая округа Техас и Юта.
4.Количество городов, оканчивающихся на “en”, с разбивкой по коду страны. Пример:

5.Названия городов и официальный язык(и) этого города, где население менее 10000 человек.
6.Вывести список городов, которые относятся к странам, в которых четыре и более официальных языков.
7.Количество городов, в которых русский язык является не официальным.
8.Количество городов, где на официальном языке говорят менее 1% жителей. Join таблиц не использовать.
9.Названия округов региона Западная Африка, где продолжительность жизни больше 60 и на неофициальном языке говорит больше 10% населения
10.Все данные удовлетворяющие условию: форма правления - Республика и язык - Испанский, регион Америка (любая)

 */
public class Task {
}
