package part4.HM_4_4;

import java.util.ArrayList;
import java.util.List;

/*
Выбрать по 15 мужских и женских имен и фамилий.  Сгенерировать все возможные комбинации: имя, фамилия пол, возраст (рандомно от 3 до 90).
Используя генератор создать список из объектов класса Person.
Используя stream api определить:
Общее количество людей
Общее количество мужчин
Сколько женщин несовершеннолетних
Сколько мужчин и женщин пенсионного возраста (учитывая последнюю пенсионную реформу) */
public class Task {
    public static void main(String[] args) {
    }
}
